IDENTIFICATION DIVISION.
PROGRAM-ID. STATMEASURE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE ASSIGN TO USER-FNAME
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
    02 INPUT-X PIC S9(6)V9(2).
    02 FILLER PIC X(72).

WORKING-STORAGE SECTION.
77 SUM-OF-X-SQR PIC 9(14)V9(2).
77 SUM-OF-X PIC S9(10)V9(2).
77 N PIC S9(4).
77 MEAN PIC S9(6)V9(2).
77 I PIC S9(4).

01 ARRAY-AREA.
    02 X PIC S9(6)V9(2) OCCURS 1000 TIMES.

01 INPUT-VALUE-RECORD.
    02 IN-X PIC S9(6)V9(2).
    02 FILLER PIC X(72).

01 OUTPUT-TITLE-LINE.
    02 FILLER PIC X(28) 
    VALUE " MEAN AND STANDARD DEVIATION".

01 OUTPUT-UNDERLINE.
    02 FILLER PIC X(28) 
    VALUE "----------------------------".

01 OUTPUT-COL-HEADS.
    02 FILLER PIC X(10) VALUE SPACES.
    02 FILLER PIC X(11) VALUE "DATA VALUES".

01 OUTPUT-DATA-LINE.
    02 FILLER PIC X(10) VALUE SPACES.
    02 OUT-X PIC S9(6)V99.

01 OUTPUT-MEAN.
    02 FILLER PIC X(9) VALUE " MEAN= ".
    02 OUT-MEAN PIC S9(6)V99.

01 OUTPUT-STD-DEV.
    02 FILLER PIC X(9) VALUE " STD DEV=".
    02 OUT-STD-DEVIATION PIC S9(6)V99.

01 USER-FNAME PIC X(256).

PROCEDURE DIVISION.
USER-INPUT.
    DISPLAY "ENTER INPUT FILE: "
    ACCEPT USER-FNAME
    STOP RUN.
